[
  {
    "title": "The Creation of the World",
    "ref": "Genesis 1:1–31",
    "text": "In the beginning God created the heavens and the earth. God said, 'Let there be light,' and there was light. He separated the light from the darkness, the waters from the dry land, and filled the earth with living creatures. On the sixth day, God created mankind in His image and gave them dominion over the earth. God saw all that He had made, and it was very good."
  },
  {
    "title": "The Creation of Man and Woman",
    "ref": "Genesis 2:7–25",
    "text": "Then the Lord God formed man from the dust of the ground and breathed into his nostrils the breath of life, and man became a living being. God planted a garden in Eden and placed the man there to care for it. He made woman from the man's rib to be his companion. They lived in harmony with creation, naked and unashamed."
  },
  {
    "title": "The Fall of Man",
    "ref": "Genesis 3:1–24",
    "text": "The serpent deceived Eve into eating from the tree that God had forbidden. She gave some to Adam, and he also ate. Their eyes were opened, and they realized they were naked. Because of their disobedience, they were sent out of Eden, but God promised a Redeemer who would one day crush the serpent's head."
  },
  {
    "title": "Cain and Abel",
    "ref": "Genesis 4:1–16",
    "text": "Adam and Eve had two sons, Cain and Abel. Cain offered God fruit from the ground, while Abel offered the best of his flock. God accepted Abel’s offering but not Cain’s, and in jealousy, Cain killed his brother. When confronted, Cain said, 'Am I my brother’s keeper?' God marked him so that no one would kill him, but he was sent to wander the earth."
  },
  {
    "title": "Noah and the Flood",
    "ref": "Genesis 6:9–22",
    "text": "The earth became corrupt and full of violence, but Noah found favor with God. God told him to build an ark and bring two of every kind of creature inside. Rain fell for forty days and nights, covering the earth. When the waters receded, God made a covenant with Noah, promising never again to destroy the world with a flood."
  },
  {
    "title": "The Call of Abraham",
    "ref": "Genesis 12:1–9",
    "text": "The Lord said to Abram, 'Go from your country and your father’s house to the land I will show you. I will make you into a great nation.' Abram obeyed and set out with Sarai and Lot. When he reached Canaan, God promised, 'To your offspring I will give this land.' Abram built an altar there to the Lord."
  },
  {
    "title": "The Birth of Isaac",
    "ref": "Genesis 21:1–7",
    "text": "The Lord kept His promise to Sarah, and she bore a son to Abraham in their old age. Abraham named him Isaac, meaning 'laughter,' for Sarah said, 'God has brought me laughter, and everyone who hears will laugh with me.'"
  },
  {
    "title": "Joseph Sold by His Brothers",
    "ref": "Genesis 37:1–36",
    "text": "Joseph, loved by his father Jacob, was hated by his brothers because of his dreams. They threw him into a pit and sold him to merchants going to Egypt. There, Joseph was sold as a slave, but God was with him, preparing him for a greater purpose."
  },
  {
    "title": "Moses and the Burning Bush",
    "ref": "Exodus 3:1–22",
    "text": "While tending sheep, Moses saw a bush that burned without being consumed. God spoke from the bush, saying, 'I am who I am. Go, I am sending you to Pharaoh to bring my people out of Egypt.' Moses hesitated, but God promised to be with him."
  },
  {
    "title": "The Ten Commandments",
    "ref": "Exodus 20:1–17",
    "text": "On Mount Sinai, God gave Moses the Ten Commandments — laws to guide His people: to love God, honor parents, and live justly with others. The commandments became the foundation of God’s covenant with Israel."
  }
]
